timurey/oryx_stm32f205/src/my_cyclone/drivers/enc28j60.c
void enc28j60EnableIrq(NetInterface *interface)
{
	//Enable interrupts
	interface->extIntDriver->enableIrq();
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void enc28j60DisableIrq(NetInterface *interface)
{
	//Disable interrupts
	interface->extIntDriver->disableIrq();
}


/**
 * @brief ENC28J60 interrupt service routine
 * @param[in] interface Underlying network interface
 * @return TRUE if a higher priority task must be woken. Else FALSE is returned
 **/

bool_t enc28j60IrqHandler(NetInterface *interface)
{
	bool_t flag;
	uint8_t status;

	//This flag will be set if a higher priority task must be woken
	flag = FALSE;

	//Clear the INTIE bit, immediately after an interrupt event
	enc28j60ClearBit(interface, ENC28J60_REG_EIE, EIE_INTIE);

	//Read interrupt status register
	status = enc28j60ReadReg(interface, ENC28J60_REG_EIR);

	//Link status change?
	if(status & EIR_LINKIF)
	{
		//Disable LINKIE interrupt
		enc28j60ClearBit(interface, ENC28J60_REG_EIE, EIE_LINKIE);
		//Notify the user that the link state has changed
		flag |= osSetEventFromIsr(&interface->nicRxEvent);
	}
	//Packet received?
	if(status & EIR_PKTIF)
	{
		//Disable PKTIE interrupt
		enc28j60ClearBit(interface, ENC28J60_REG_EIE, EIE_PKTIE);
		//Notify the user that a packet has been received
		flag |= osSetEventFromIsr(&interface->nicRxEvent);
	}
	//Packet transmission complete?
	if(status & (EIR_TXIF | EIE_TXERIE))
	{
		//Notify the user that the transmitter is ready to send
		flag |= osSetEventFromIsr(&interface->nicTxEvent);
		//Clear interrupt flags
		enc28j60ClearBit(interface, ENC28J60_REG_EIR, EIR_TXIF | EIE_TXERIE);
	}

	//Once the interrupt has been serviced, the INTIE bit
	//is set again to re-enable interrupts
	enc28j60SetBit(interface, ENC28J60_REG_EIE, EIE_INTIE);

	//A higher priority task must be woken?
	return flag;
}


/**
 * @brief ENC28J60 event handler
 * @param[in] interface Underlying network interface
 **/

void enc28j60EventHandler(NetInterface *interface)
{
	error_t error;
	uint16_t status, status1;
	size_t length;

	//Read interrupt status register
	status = enc28j60ReadReg(interface, ENC28J60_REG_EIR);

	//Check whether the link state has changed
	if(status & EIR_LINKIF)
	{
		//Clear PHY interrupts flags
		enc28j60ReadPhyReg(interface, ENC28J60_PHY_REG_PHIR);
		//Clear interrupt flag
		enc28j60ClearBit(interface, ENC28J60_REG_EIR, EIR_LINKIF);
		//Read PHY status register
		status1 = enc28j60ReadPhyReg(interface, ENC28J60_PHY_REG_PHSTAT2);

		//Check link state
		if(status1 & PHSTAT2_LSTAT)
		{
			//Link is up
			interface->linkState = TRUE;
			//Link speed
			interface->speed100 = FALSE;

#if (ENC28J60_FULL_DUPLEX_SUPPORT == ENABLED)
			//Full-duplex mode
			interface->fullDuplex = TRUE;
			//Display link state
			TRACE_INFO("Link is up (%s)...\r\n", interface->name);
			//Display actual speed and duplex mode
			TRACE_INFO("10BASE-T Full-Duplex\r\n");
#else
			//Half-duplex mode
			interface->fullDuplex = FALSE;
			//Display link state
			TRACE_INFO("Link is up (%s)...\r\n", interface->name);
			//Display actual speed and duplex mode
			TRACE_INFO("10BASE-T Half-Duplex\r\n");
#endif
		}
		else
		{
			//Link is down
			interface->linkState = FALSE;
			//Display link state
			TRACE_INFO("Link is down (%s)...\r\n", interface->name);
		}

		//Process link state change event
		nicNotifyLinkChange(interface);
	}
	//Check whether a packet has been received?
	if(status & EIR_PKTIF)
	{
		//Clear interrupt flag
		enc28j60ClearBit(interface, ENC28J60_REG_EIR, EIR_PKTIF);

		//Process all pending packets
		do
		{
			//Read incoming packet
			error = enc28j60ReceivePacket(interface,
					interface->ethFrame, ETH_MAX_FRAME_SIZE, &length);

			//Check whether a valid packet has been received
			if(!error)
			{
				//Pass the packet to the upper layer
				nicProcessPacket(interface, interface->ethFrame, length);
			}

			//No more data in the receive buffer?
		} while(error != ERROR_BUFFER_EMPTY);
	}

	//Re-enable LINKIE and PKTIE interrupts
	enc28j60SetBit(interface, ENC28J60_REG_EIE, EIE_LINKIE | EIE_PKTIE);
}


/**
 * @brief Configure multicast MAC address filtering
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t enc28j60SetMacFilter(NetInterface *interface)
{
	uint_t i;
	uint_t k;
	uint32_t crc;
	uint8_t hashTable[8];

	//Debug message
	TRACE_DEBUG("Updating ENC28J60 hash table...\r\n");

	//Clear hash table
	memset(hashTable, 0, sizeof(hashTable));

	//The MAC filter table contains the multicast MAC addresses
	//to accept when receiving an Ethernet frame
	for(i = 0; i < interface->macFilterSize; i++)
	{
		//Compute CRC over the current MAC address
		crc = enc28j60CalcCrc(&interface->macFilter[i].addr, sizeof(MacAddr));
		//Calculate the corresponding index in the table
		k = (crc >> 23) & 0x3F;
		//Update hash table contents
		hashTable[k / 8] |= (1 << (k % 8));
	}

	//Write the hash table to the ENC28J60 controller
	enc28j60WriteReg(interface, ENC28J60_REG_EHT0, hashTable[0]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT1, hashTable[1]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT2, hashTable[2]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT3, hashTable[3]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT4, hashTable[4]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT5, hashTable[5]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT6, hashTable[6]);
	enc28j60WriteReg(interface, ENC28J60_REG_EHT7, hashTable[7]);

	//Debug message
	TRACE_DEBUG("  EHT0 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT0));
	TRACE_DEBUG("  EHT1 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT1));
	TRACE_DEBUG("  EHT2 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT2));
	TRACE_DEBUG("  EHT3 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT3));
	TRACE_DEBUG("  EHT0 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT4));
	TRACE_DEBUG("  EHT1 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT5));
	TRACE_DEBUG("  EHT2 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT6));
	TRACE_DEBUG("  EHT3 = %02" PRIX8 "\r\n", enc28j60ReadReg(interface, ENC28J60_REG_EHT7));

	//Successful processing
	return NO_ERROR;
}


/**
 * @brief Send a packet
 * @param[in] interface Underlying network interface
 * @param[in] buffer Multi-part buffer containing the data to send
 * @param[in] offset Offset to the first data byte
 * @return Error code
 **/

