timurey/oryx_stm32f205/src/my_cyclone/drivers/enc28j60.c
error_t enc28j60SendPacket(NetInterface *interface,
		const NetBuffer *buffer, size_t offset)
{
	size_t length;

	//Retrieve the length of the packet
	length = netBufferGetLength(buffer) - offset;

	//Check the frame length
	if(length > 1536)
	{
		//The transmitter can accept another packet
		osSetEvent(&interface->nicTxEvent);
		//Report an error
		return ERROR_INVALID_LENGTH;
	}

	//Make sure the link is up before transmitting the frame
	if(!interface->linkState)
	{
		//The transmitter can accept another packet
		osSetEventFromIsr(&interface->nicTxEvent);
		//Drop current packet
		return NO_ERROR;
	}

	//It is recommended to reset the transmit logic before
	//attempting to transmit a packet
	enc28j60SetBit(interface, ENC28J60_REG_ECON1, ECON1_TXRST);
	enc28j60ClearBit(interface, ENC28J60_REG_ECON1, ECON1_TXRST);

	//Interrupt flags should be cleared after the reset is completed
	enc28j60ClearBit(interface, ENC28J60_REG_EIR, EIR_TXIF | EIR_TXERIF);

	//Set transmit buffer location
	enc28j60WriteReg(interface, ENC28J60_REG_ETXSTL, LSB(ENC28J60_TX_BUFFER_START));
	enc28j60WriteReg(interface, ENC28J60_REG_ETXSTH, MSB(ENC28J60_TX_BUFFER_START));

	//Point to start of transmit buffer
	enc28j60WriteReg(interface, ENC28J60_REG_EWRPTL, LSB(ENC28J60_TX_BUFFER_START));
	enc28j60WriteReg(interface, ENC28J60_REG_EWRPTH, MSB(ENC28J60_TX_BUFFER_START));

	//Copy the data to the transmit buffer
	enc28j60WriteBuffer(interface, buffer, offset);

	//ETXND should point to the last byte in the data payload
	enc28j60WriteReg(interface, ENC28J60_REG_ETXNDL, LSB(ENC28J60_TX_BUFFER_START + length));
	enc28j60WriteReg(interface, ENC28J60_REG_ETXNDH, MSB(ENC28J60_TX_BUFFER_START + length));

	//Start transmission
	enc28j60SetBit(interface, ENC28J60_REG_ECON1, ECON1_TXRTS);

	//Successful processing
	return NO_ERROR;
}


/**
 * @brief Receive a packet
 * @param[in] interface Underlying network interface
 * @param[out] buffer Buffer where to store the incoming data
 * @param[in] size Maximum number of bytes that can be received
 * @param[out] length Number of bytes that have been received
 * @return Error code
 **/

error_t enc28j60ReceivePacket(NetInterface *interface,
		uint8_t *buffer, size_t size, size_t *length)
{
	error_t error;
	uint16_t n;
	uint16_t status;
	Enc28j60Context *context;

	//Point to the driver context
	context = (Enc28j60Context *) interface->nicContext;

	//Any packet pending in the receive buffer?
	if(enc28j60ReadReg(interface, ENC28J60_REG_EPKTCNT))
	{
		//Point to the start of the received packet
		enc28j60WriteReg(interface, ENC28J60_REG_ERDPTL, LSB(context->nextPacket));
		enc28j60WriteReg(interface, ENC28J60_REG_ERDPTH, MSB(context->nextPacket));

		//Read the first two bytes, which are the address of the next packet
		enc28j60ReadBuffer(interface, (uint8_t *) &context->nextPacket, sizeof(uint16_t));
		//Get the length of the received frame in bytes
		enc28j60ReadBuffer(interface, (uint8_t *) &n, sizeof(uint16_t));
		//Read the receive status vector (RSV)
		enc28j60ReadBuffer(interface, (uint8_t *) &status, sizeof(uint16_t));

		//Make sure no error occurred
		if(status & RSV_RECEIVED_OK)
		{
			//Limit the number of data to read
			size = MIN(size, n);
			//Read the Ethernet frame
			enc28j60ReadBuffer(interface, buffer, size);

			//Total number of bytes that have been received
			*length = size;
			//Packet successfully received
			error = NO_ERROR;
		}
		else
		{
			//The received packet contains an error
			error = ERROR_INVALID_PACKET;
		}

		//Advance the ERXRDPT pointer, taking care to wrap back at the
		//end of the received memory buffer
		if(context->nextPacket == ENC28J60_RX_BUFFER_START)
		{
			enc28j60WriteReg(interface, ENC28J60_REG_ERXRDPTL, LSB(ENC28J60_RX_BUFFER_STOP));
			enc28j60WriteReg(interface, ENC28J60_REG_ERXRDPTH, MSB(ENC28J60_RX_BUFFER_STOP));
		}
		else
		{
			enc28j60WriteReg(interface, ENC28J60_REG_ERXRDPTL, LSB(context->nextPacket - 1));
			enc28j60WriteReg(interface, ENC28J60_REG_ERXRDPTH, MSB(context->nextPacket - 1));
		}

		//Decrement the packet counter
		enc28j60SetBit(interface, ENC28J60_REG_ECON2, ECON2_PKTDEC);
	}
	else
	{
		//No more data in the receive buffer
		error = ERROR_BUFFER_EMPTY;
	}

	//Return status code
	return error;
}


/**
 * @brief ENC28J60 controller reset
 * @param[in] interface Underlying network interface
 **/

void enc28j60SoftReset(NetInterface *interface)
{
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode
	spiTransfer(ENC28J60_CMD_SRC);

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief Bank selection
 * @param[in] interface Underlying network interface
 * @param[in] address Register address
 **/

void enc28j60SelectBank(NetInterface *interface, uint16_t address)
{
	uint16_t bank;
	Enc28j60Context *context;

	//Point to the driver context
	context = (Enc28j60Context *) interface->nicContext;

	//Get the bank number from the specified address
	bank = address & REG_BANK_MASK;

	//Rewrite the bank number only if a change is detected
	if(bank != context->currentBank)
	{
		//Select specified bank
		switch(bank)
		{
		case BANK_0:
			//Select bank 0
			enc28j60ClearBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL1 | ECON1_BSEL0);
			break;
		case BANK_1:
			//Select bank 1
			enc28j60SetBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL0);
			enc28j60ClearBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL1);
			break;
		case BANK_2:
			//Select bank 2
			enc28j60ClearBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL0);
			enc28j60SetBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL1);
			break;
		case BANK_3:
			//Select bank 3
			enc28j60SetBit(interface, ENC28J60_REG_ECON1, ECON1_BSEL1 | ECON1_BSEL0);
			break;
		default:
			//Invalid bank
			break;
		}

		//Save bank number
		context->currentBank = bank;
	}
}


/**
 * @brief Write ENC28J60 register
 * @param[in] interface Underlying network interface
 * @param[in] address Register address
 * @param[in] data Register value
 **/

void enc28j60WriteReg(NetInterface *interface, uint16_t address, uint8_t data)
{
	//Make sure the corresponding bank is selected
	enc28j60SelectBank(interface, address);

