timurey/oryx_stm32f205/src/my_cyclone/drivers/enc28j60.c
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode and register address
	spiTransfer(ENC28J60_CMD_WCR | (address & REG_ADDR_MASK));
	//Write register value
	interface->spiDriver->transfer(data);

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief Read ENC28J60 register
 * @param[in] interface Underlying network interface
 * @param[in] address Register address
 * @return Register value
 **/

uint8_t enc28j60ReadReg(NetInterface *interface, uint16_t address)
{
	uint16_t data;

	//Make sure the corresponding bank is selected
	enc28j60SelectBank(interface, address);

	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode and register address
	spiTransfer(ENC28J60_CMD_RCR | (address & REG_ADDR_MASK));

	//When reading MAC or MII registers, a dummy byte is first shifted out
	if((address & REG_TYPE_MASK) != ETH_REG_TYPE)
		spiTransfer(0x00);

	//Read register contents
	data = spiTransfer(0x00);

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();

	//Return register contents
	return data;
}


/**
 * @brief Write PHY register
 * @param[in] interface Underlying network interface
 * @param[in] address PHY register address
 * @param[in] data Register value
 **/

void enc28j60WritePhyReg(NetInterface *interface, uint16_t address, uint16_t data)
{
	//Write register address
	enc28j60WriteReg(interface, ENC28J60_REG_MIREGADR, address & REG_ADDR_MASK);

	//Write the lower 8 bits
	enc28j60WriteReg(interface, ENC28J60_REG_MIWRL, LSB(data));
	//Write the upper 8 bits
	enc28j60WriteReg(interface, ENC28J60_REG_MIWRH, MSB(data));

	//Wait until the PHY register has been written
	while(enc28j60ReadReg(interface, ENC28J60_REG_MISTAT) & MISTAT_BUSY)
   {
      taskYIELD();
   }
}


/**
 * @brief Read PHY register
 * @param[in] interface Underlying network interface
 * @param[in] address PHY register address
 * @return Register value
 **/

uint16_t enc28j60ReadPhyReg(NetInterface *interface, uint16_t address)
{
	uint16_t data;

	//Write register address
	enc28j60WriteReg(interface, ENC28J60_REG_MIREGADR, address & REG_ADDR_MASK);

	//Start read operation
	enc28j60WriteReg(interface, ENC28J60_REG_MICMD, MICMD_MIIRD);
	//Wait for the read operation to complete
	while(enc28j60ReadReg(interface, ENC28J60_REG_MISTAT) & MISTAT_BUSY)
   {
      taskYIELD();
   }
	//Clear command register
	enc28j60WriteReg(interface, ENC28J60_REG_MICMD, 0);

	//Read the lower 8 bits
	data = enc28j60ReadReg(interface, ENC28J60_REG_MIRDL);
	//Read the upper 8 bits
	data |= enc28j60ReadReg(interface, ENC28J60_REG_MIRDH) << 8;

	//Return register contents
	return data;
}


/**
 * @brief Write SRAM buffer
 * @param[in] interface Underlying network interface
 * @param[in] buffer Multi-part buffer containing the data to be written
 * @param[in] offset Offset to the first data byte
 **/

void enc28j60WriteBuffer(NetInterface *interface,
		const NetBuffer *buffer, size_t offset)
{
	uint_t i;
	size_t n;
	uint8_t *p;
#ifndef DMA_TX
   size_t j;
#else //DMA_TX

   extern SPI_HandleTypeDef hspi1;

	osResetEvent(&spiSemaphore);
	interface->spiDriver->setMode(spiModeDmaTx);
#endif
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode
	interface->spiDriver->transfer(ENC28J60_CMD_WBM);
	//Write per-packet control byte
	interface->spiDriver->transfer(0x00);

	//Loop through data chunks
	for(i = 0; i < buffer->chunkCount; i++)
	{
		//Is there any data to copy from the current chunk?
		if(offset < buffer->chunk[i].length)
		{
			//Point to the first byte to be read
			p = (uint8_t *) buffer->chunk[i].address + offset;
			//Compute the number of bytes to copy at a time
			n = buffer->chunk[i].length - offset;
#ifndef DMA_TX
			//Copy data to SRAM buffer
			for(j = 0; j < n; j++)
				interface->spiDriver->transfer(p[j]);
#endif
#ifdef DMA_TX
			HAL_SPI_Transmit_DMA(&hspi1,(uint8_t *)p, n);
			osWaitForEvent(&spiSemaphore, INFINITE_DELAY);
			while (HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY)
			{
			   taskYIELD();
			}
#endif
			//Process the next block from the start
			offset = 0;
		}
		else
		{
			//Skip the current chunk
			offset -= buffer->chunk[i].length;
		}
	}

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief Read SRAM buffer
 * @param[in] interface Underlying network interface
 * @param[in] data Buffer where to store the incoming data
 * @param[in] length Number of data to read
 **/

void enc28j60ReadBuffer(NetInterface *interface,
		uint8_t *data, size_t length)
{
#ifndef DMA_RX
	size_t i;
#else  // DMA_RX
	extern SPI_HandleTypeDef hspi1;
	uint8_t tmpx = 0xff;

	osResetEvent(&spiSemaphore);

	interface->spiDriver->setMode(spiModeDmaRx);
#endif
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode
	interface->spiDriver->transfer(ENC28J60_CMD_RBM);

#ifndef DMA_RX
	//Copy data from SRAM buffer
	for(i = 0; i < length; i++)
		data[i] = interface->spiDriver->transfer(0x00);
#endif
#ifdef DMA_RX
	HAL_SPI_TransmitReceive_DMA(&hspi1, &tmpx, data, (uint16_t)length);

	osWaitForEvent(&spiSemaphore, INFINITE_DELAY);
	while (HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY)
	{
	   taskYIELD();
	}
#endif
	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief Set bit field
 * @param[in] interface Underlying network interface
 * @param[in] address Register address
 * @param[in] mask Bits to set in the target register
 **/

void enc28j60SetBit(NetInterface *interface, uint16_t address, uint16_t mask)
{
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode and register address
	spiTransfer(ENC28J60_CMD_BFS | (address & REG_ADDR_MASK));
	//Write bit mask
	spiTransfer(mask);

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief Clear bit field
 * @param[in] interface Underlying network interface
 * @param[in] address Register address
 * @param[in] mask Bits to clear in the target register
 **/

