timurey/oryx_stm32f205/src/my_cyclone/drivers/enc28j60.c
void enc28j60ClearBit(NetInterface *interface, uint16_t address, uint16_t mask)
{
	//Pull the CS pin low
	interface->spiDriver->assertCs();

	//Write opcode and register address
	spiTransfer(ENC28J60_CMD_BFC | (address & REG_ADDR_MASK));
	//Write bit mask
	spiTransfer(mask);

	//Terminate the operation by raising the CS pin
	interface->spiDriver->deassertCs();
}


/**
 * @brief CRC calculation using the polynomial 0x4C11DB7
 * @param[in] data Pointer to the data over which to calculate the CRC
 * @param[in] length Number of bytes to process
 * @return Resulting CRC value
 **/

uint32_t enc28j60CalcCrc(const void *data, size_t length)
{
	uint_t i;
	uint_t j;

	//Point to the data over which to calculate the CRC
	const uint8_t *p = (uint8_t *) data;
	//CRC preset value
	uint32_t crc = 0xFFFFFFFF;

	//Loop through data
	for(i = 0; i < length; i++)
	{
		//The message is processed bit by bit
		for(j = 0; j < 8; j++)
		{
			//Update CRC value
			if(((crc >> 31) ^ (p[i] >> j)) & 0x01)
				crc = (crc << 1) ^ 0x04C11DB7;
			else
				crc = crc << 1;
		}
	}

	//Return CRC value
	return crc;
}


/**
 * @brief Dump registers for debugging purpose
 * @param[in] interface Underlying network interface
 **/

void enc28j60DumpReg(NetInterface *interface)
{
   (void) interface;
#if (TRACE_LEVEL >= TRACE_LEVEL_DEBUG)
	uint8_t i;
	uint8_t bank;
	uint16_t address;


	//Display header
	TRACE_DEBUG("    Bank 0  Bank 1  Bank 2  Bank 3\r\n");

	//Loop through register addresses
	for(i = 0; i < 32; i++)
	{
		//Display register address
		TRACE_DEBUG("%02" PRIX8 ": ", i);

		//Loop through bank numbers
		for(bank = 0; bank < 4; bank++)
		{
			//Format register address
			address = (bank << 8) | i;

			//MAC and MII registers require a specific read sequence
			if(address >= 0x200 && address <= 0x219)
				address |= MAC_REG_TYPE;
			else if(address >= 0x300 && address <= 0x305)
				address |= MAC_REG_TYPE;
			else if(address == 0x30A)
				address |= MAC_REG_TYPE;

			//Display register contents
			TRACE_DEBUG("0x%02" PRIX8 "    ", enc28j60ReadReg(interface, address));
		}

		//Jump to the following line
		TRACE_DEBUG("\r\n");
	}

	//Terminate with a line feed
	TRACE_DEBUG("\r\n");
#endif
}


/**
 * @brief Dump PHY registers for debugging purpose
 * @param[in] interface Underlying network interface
 **/

void enc28j60DumpPhyReg(NetInterface *interface)
{
   (void) interface;
#if (TRACE_LEVEL >= TRACE_LEVEL_DEBUG)
	uint8_t i;

	//Loop through PHY registers
	for(i = 0; i < 32; i++)
	{
		//Display current PHY register
		TRACE_DEBUG("%02" PRIX8 ": 0x%04" PRIX16 "\r\n", i, enc28j60ReadPhyReg(interface, i));
	}

	//Terminate with a line feed
	TRACE_DEBUG("\r\n");
#endif
}
#ifdef SPI_USE_DMA
/*
 * По окончанию передачи можно использовать callback функции
 * HAL_SPI_TxCpltCallback
 *
 */
void DMA2_Stream0_IRQHandler(void)
{
	portBASE_TYPE flag;
	HAL_DMA_IRQHandler(hspi1.hdmarx);
	flag=osSetEventFromIsr(&spiSemaphore);
	osExitIsr(flag);
}

/**
 * @brief  This function handles DMA Tx interrupt request.
 * @param  None
 * @retval None
 */
void DMA2_Stream5_IRQHandler(void)
{
	portBASE_TYPE flag;
	HAL_DMA_IRQHandler(hspi1.hdmatx);
	flag=osSetEventFromIsr(&spiSemaphore);
	osExitIsr(flag);
}
#endif
